veraneio/app/controllers/admin/periodos_controller.rb

SELECT "periodos".* FROM "periodos"
---
  def index
    @admin_periodos = Periodo.all

INSERT INTO "admin_periodos" ("inicio", "termino", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["inicio", "2016-11-08 16:59:00.000000"], ["termino", "2016-11-08 16:59:00.000000"], ["created_at", "2016-11-08 16:59:46.429021"], ["updated_at", "2016-11-08 16:59:46.429021"]]
INSERT INTO "periodos" ("inicio", "termino", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["inicio", "2016-11-08 22:54:00.000000"], ["termino", "2016-11-08 22:54:00.000000"], ["created_at", "2016-11-08 22:55:22.961274"], ["updated_at", "2016-11-08 22:55:22.961274"]]
---
  def create
    @admin_periodo = Periodo.new(inicio: params[:inicio], termino: params[:termino])

    respond_to do |format|
      if @admin_periodo.save

UPDATE "periodos" SET "termino" = ?, "updated_at" = ? WHERE "periodos"."id" = ?  [["termino", "2016-11-10 21:39:00.000000"], ["updated_at", "2016-11-10 18:39:39.567505"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @admin_periodo.update(inicio: params[:inicio], termino: params[:termino])

DELETE FROM "admin_periodos" WHERE "admin_periodos"."id" = ?  [["id", 1]]
DELETE FROM "periodos" WHERE "periodos"."id" = ?  [["id", 2]]
---
  def destroy
    @admin_periodo.destroy

SELECT  "periodos".* FROM "periodos" WHERE "periodos"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_admin_periodo
      @admin_periodo = Periodo.find(params[:id])