veraneio/app/controllers/admin/trabalhos_controller.rb

UPDATE "trabalhos" SET "estado" = ?, "updated_at" = ? WHERE "trabalhos"."id" = ?  [["estado", "Enviado para Avaliação"], ["updated_at", "2016-11-04 16:34:39.890251"], ["id", 1]]
---
    def update
        @orientador = Professor.where(email: params[:orientador]).first
        @banca_1 = Professor.where(email: params[:banca_1]).first
        @banca_2 = Professor.where(email: params[:banca_2]).first
        @trabalho = Trabalho.find params[:id]

        if @trabalho.estado == "Recebido do Aluno"
            puts("o: #{@orientador.email}")
            if @banca_1.email != @banca_2.email
                #Dani, divirta-se aqui

                @trabalho.update estado: "Enviado para Avaliação"