veraneio/app/controllers/admin/trabalhos_controller.rb

    def index
        @trabalhos = Trabalho.all
        @professores = Professor.all
        @count_recebidos = Trabalho.where(estado: "Recebido do Aluno").count
---
SELECT "trabalhos".* FROM "trabalhos"
SELECT COUNT(*) FROM "trabalhos" WHERE "trabalhos"."estado" = ?  [["estado", "Recebido do Aluno"]]

    def update
        @banca_1 = Professor.where(email: params[:trabalho][:banca_1]).first
        @banca_2 = Professor.where(email: params[:trabalho][:banca_2]).first
        @trabalho = Trabalho.find params[:id]
---
SELECT  "trabalhos".* FROM "trabalhos" WHERE "trabalhos"."id" = ? LIMIT 1  [["id", 1]]