veraneio/app/controllers/sessions_controller.rb

	def create
		@usuario = Usuario.find_by(email: params[:email])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = ? LIMIT 1  [["email", "teste@teste.com"]]