veraneio/app/controllers/trabalhos_controller.rb

	def new
		@trabalho = @estudante.build_trabalho
		@trabalho.build_orientador
		@trabalho.build_banca_1
		@trabalho.build_banca_2
		@horario_servidor = DateTime.now
		@periodo_maximo = Periodo.order(:termino).last.termino
---
SELECT  "periodos".* FROM "periodos"  ORDER BY "periodos"."termino" DESC LIMIT 1

	def create

		@horario_servidor = DateTime.now
		@periodo_maximo = Periodo.order(:termino).last.termino
		@trabalho = @estudante.build_trabalho(titulo: params[:trabalho][:titulo], arquivo: params[:trabalho][:arquivo])
		@orientador = Professor.where(email: params[:trabalho][:orientador_attributes][:email]).first
		@banca_1 = Professor.where(nome: params[:trabalho][:banca_1_attributes][:nome]).first
		@banca_2 = Professor.where(nome: params[:trabalho][:banca_2_attributes][:nome]).first

		verifica_se_existe_no_banco

		@trabalho.estado = "Recebido do Aluno"

		if (@periodo_maximo >= @horario_servidor) and @trabalho.save
			@adm = Admin.first
			@estudante = Estudante.find(params[:estudante_id])
---
SELECT  "periodos".* FROM "periodos"  ORDER BY "periodos"."termino" DESC LIMIT 1
INSERT INTO "trabalhos" ("titulo", "arquivo_file_name", "arquivo_content_type", "arquivo_file_size", "arquivo_updated_at", "estudante_id", "orientador_id", "banca_1_id", "banca_2_id", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "trabalhos".* FROM "trabalhos" WHERE "trabalhos"."estudante_id" = ? LIMIT 1  [["estudante_id", 1]]

	def update
		@trabalho = @estudante.trabalho
		@orientador = Professor.where(email: params[:trabalho][:orientador_attributes][:email]).first
		@banca_1 = Professor.where(nome: params[:trabalho][:banca_1_attributes][:nome]).first
		@banca_2 = Professor.where(nome: params[:trabalho][:banca_2_attributes][:nome]).first

		verifica_se_existe_no_banco

		@trabalho.titulo = params[:trabalho][:titulo]
		unless params[:trabalho][:arquivo].nil?
			@trabalho.arquivo = params[:trabalho][:arquivo]
		end

		if (@periodo_maximo >= @horario_servidor) and @trabalho.save
---
UPDATE "trabalhos" SET "arquivo_file_name" = ?, "arquivo_file_size" = ?, "arquivo_updated_at" = ?, "updated_at" = ? WHERE "trabalhos"."id" = ?  [["arquivo_file_name", "05_busca_local.pdf"], ["arquivo_file_size", 507273], ["arquivo_updated_at", "2016-11-04 16:32:29.314752"], ["updated_at", "2016-11-04 16:32:29.325809"], ["id", 1]]